; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image0 - mode
	infrared1 - mode
	spectrograph2 - mode
	GroundStation2 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star3 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star0)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument3 spectrograph2)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
	(supports instrument6 spectrograph2)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star5)
	(supports instrument8 image0)
	(supports instrument8 spectrograph2)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 Star3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite2 Star0)
	(pointing satellite3 Star5)
	(have_image Star6 infrared1)
	(have_image Planet7 image0)
	(have_image Phenomenon8 image0)
	(have_image Star9 spectrograph2)
	(have_image Phenomenon10 spectrograph2)
	(have_image Star11 spectrograph2)
	(have_image Star12 infrared1)
	(have_image Planet13 infrared1)
))

)

; plan
1. (turn_to satellite2 star0 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star0)
   goals met: 1 of 11
2. (turn_to satellite0 groundstation1 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 11
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 11
4. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 1 of 11
5. (turn_to satellite0 planet7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet7)
   goals met: 1 of 11
6. (take_image satellite0 planet7 instrument2 image0)
   added: (have_image planet7 image0)
   goals met: 2 of 11
7. (turn_to satellite0 planet13 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet13)
   goals met: 2 of 11
8. (take_image satellite0 planet13 instrument2 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 3 of 11
9. (turn_to satellite0 phenomenon8 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 11
10. (take_image satellite0 phenomenon8 instrument2 image0)
   added: (have_image phenomenon8 image0)
   goals met: 4 of 11
11. (turn_to satellite0 phenomenon10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 11
12. (take_image satellite0 phenomenon10 instrument2 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 5 of 11
13. (turn_to satellite0 star11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star11)
   goals met: 5 of 11
14. (take_image satellite0 star11 instrument2 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 6 of 11
15. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 6 of 11
16. (take_image satellite0 star12 instrument2 infrared1)
   added: (have_image star12 infrared1)
   goals met: 7 of 11
17. (turn_to satellite0 star6 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star6)
   goals met: 7 of 11
18. (take_image satellite0 star6 instrument2 infrared1)
   added: (have_image star6 infrared1)
   goals met: 8 of 11
19. (turn_to satellite0 star9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star9)
   goals met: 8 of 11
20. (take_image satellite0 star9 instrument2 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 9 of 11
21. (turn_to satellite0 groundstation4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation4)
   goals met: 10 of 11
22. (turn_to satellite3 star5 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star5)
   goals met: 11 of 11
